package com.template

enum class Question(val question: String, val listOfAnswers: List<String>, val rightAnswer: String) {
    QUESTION_1("ЗАМЕНИТЬ_ВОПРОС_1", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_2("ЗАМЕНИТЬ_ВОПРОС_2", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_3("ЗАМЕНИТЬ_ВОПРОС_3", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_4("ЗАМЕНИТЬ_ВОПРОС_4", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_5("ЗАМЕНИТЬ_ВОПРОС_5", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_6("ЗАМЕНИТЬ_ВОПРОС_6", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_7("ЗАМЕНИТЬ_ВОПРОС_7", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_8("ЗАМЕНИТЬ_ВОПРОС_8", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_9("ЗАМЕНИТЬ_ВОПРОС_9", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_10("ЗАМЕНИТЬ_ВОПРОС_10", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_11("ЗАМЕНИТЬ_ВОПРОС_11", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_12("ЗАМЕНИТЬ_ВОПРОС_12", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_13("ЗАМЕНИТЬ_ВОПРОС_13", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_14("ЗАМЕНИТЬ_ВОПРОС_14", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_15("ЗАМЕНИТЬ_ВОПРОС_15", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_16("ЗАМЕНИТЬ_ВОПРОС_16", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_17("ЗАМЕНИТЬ_ВОПРОС_17", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_18("ЗАМЕНИТЬ_ВОПРОС_18", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_19("ЗАМЕНИТЬ_ВОПРОС_19", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ"),
    QUESTION_20("ЗАМЕНИТЬ_ВОПРОС_20", listOf("НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "НЕПРАВИЛЬНЫЙ ОТВЕТ", "ПРАВИЛЬНЫЙ ОТВЕТ"), "ПРАВИЛЬНЫЙ ОТВЕТ")
}